app/views/users/show.html.erb


<% if @user.favorites.empty? %>
---
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? LIMIT 1  [["user_id", 2]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 2]]