app/views/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
---

  <% @cart.sort_items.each do |item| %>

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
          <p class="text-danger"><strong><%= number_to_currency(item.product.price) %></strong></p>
          <% if !current_user.find_product(item.product.id) %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."product_id" = ?  [["product_id", 1]]
---
          <% end %>
          <p><%= item.product.favorites.count %> likes</p>