app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 11]]
---
  def destroy
    @cart = current_cart
    @cart.get_items(nil)
    @cart.destroy

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 53]]
---
  def set_cart
    @cart = Cart.find(params[:id])