app/controllers/favorites_controller.rb

  def create
    user = current_user
    product = Product.find(params[:product_id])
    @favorite=user.like_product(product.id)

    respond_to do |format|
      if @favorite.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "favorites" ("product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["user_id", 2], ["created_at", "2015-11-03 23:29:37.515042"], ["updated_at", "2015-11-03 23:29:37.515042"]]
UPDATE "favorites" SET "like" = ?, "updated_at" = ? WHERE "favorites"."id" = ?  [["like", 2], ["updated_at", "2015-11-03 23:30:45.235563"], ["id", 1]]

  def destroy
    respond_to do |format|
      format.html { redirect_to @favorite.product, notice: 'Favorite was successfully destroyed.' }
      format.json { head :no_content }
    end
    @favorite.destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]

    def set_favorite
      @favorite = Favorite.find(params[:id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT 1  [["id", 1]]