app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-03 23:29:41.562153"], ["updated_at", "2015-11-03 23:29:41.562153"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["created_at", "2015-11-03 23:29:41.725162"], ["updated_at", "2015-11-03 23:29:41.725162"]]
UPDATE "carts" SET "user_id" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["user_id", 6], ["updated_at", "2015-11-05 20:31:35.241359"], ["id", 53]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-11-03 23:31:46.762537"], ["id", 1]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save