app/views/products/show.html.erb

			  <%= link_to 'Add to Cart', line_items_path(product_id: @product), method: 'post'%>
			  <p>liked by <%= @product.favorites.count %> customers</p>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."product_id" = ?  [["product_id", 1]]